Revit 2026 API

# ElectricalSystemGroundConductorSize Property

---

The size of a Ground Conductor in the Electrical System.

**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public ElementId GroundConductorSize { get; }
```
```vb
Public ReadOnly Property GroundConductorSize As ElementId
	Get
```
```cpp
public:
property ElementId^ GroundConductorSize {
	ElementId^ get ();
}
```
```fsharp
member GroundConductorSize : ElementId with get
```

#### Property Value

ElementId

| Exception | Condition |
| --- | --- |
| InvalidOperationException | This property only available when System Type is Power! |

Each Ground Conductor has the same size in the Electrical System.

#### Reference

ElectricalSystem Class

Autodesk.Revit.DB.Electrical Namespace